### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda_function.aws_lambda_function.this[0] will be updated in-place
!   resource "aws_lambda_function" "this" {
        id                             = "cataprato-core-lambda"
!       last_modified                  = "2023-08-11T18:55:31.000+0000" -> (known after apply)
!       layers                         = [
-           "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-core-layer-s3:13",
        ] -> (known after apply)
!       qualified_arn                  = "arn:aws:lambda:us-east-1:350131064538:function:cataprato-core-lambda:13" -> (known after apply)
!       qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:cataprato-core-lambda:13/invocations" -> (known after apply)
!       s3_key                         = "lambda-builds/a74148fae6b11699785099805b107700f09ee580adc76e3b3a54e6f07df87b1a.zip" -> "lambda-builds/6ff76a11b9e970c6c4110e68731c9332d45cd8c43c1eb159fecd2f5e17114f65.zip"
!       s3_object_version              = "8Sbgu6RSgPIOUFWJ55iVwDPETgZmL4Wl" -> (known after apply)
        tags                           = {}
!       version                        = "13" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function.aws_lambda_permission.current_version_triggers["APIGatewayAny"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
!       id                  = "APIGatewayAny" -> (known after apply)
!       qualifier           = "13" -> (known after apply)
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "da315f50642b5c625938889a815dec35" -> (known after apply)
!       id                     = "lambda-builds/a74148fae6b11699785099805b107700f09ee580adc76e3b3a54e6f07df87b1a.zip" -> (known after apply)
!       key                    = "lambda-builds/a74148fae6b11699785099805b107700f09ee580adc76e3b3a54e6f07df87b1a.zip" -> "lambda-builds/6ff76a11b9e970c6c4110e68731c9332d45cd8c43c1eb159fecd2f5e17114f65.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "./.terraform/lambda-builds/a74148fae6b11699785099805b107700f09ee580adc76e3b3a54e6f07df87b1a.zip" -> "./.terraform/lambda-builds/6ff76a11b9e970c6c4110e68731c9332d45cd8c43c1eb159fecd2f5e17114f65.zip"
-       tags                   = {} -> null
!       tags_all               = {} -> (known after apply)
!       version_id             = "8Sbgu6RSgPIOUFWJ55iVwDPETgZmL4Wl" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "./.terraform/lambda-builds/"
+               build_plan    = [
+                   [
+                       "zip",
+                       "./dist/app",
+                       null,
                    ],
                ]
+               filename      = "./.terraform/lambda-builds/6ff76a11b9e970c6c4110e68731c9332d45cd8c43c1eb159fecd2f5e17114f65.zip"
+               runtime       = "nodejs18.x"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "./.terraform/lambda-builds/6ff76a11b9e970c6c4110e68731c9332d45cd8c43c1eb159fecd2f5e17114f65.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "87970168275592408" -> (known after apply)
!       triggers = {
!           "filename"  = "./.terraform/lambda-builds/a74148fae6b11699785099805b107700f09ee580adc76e3b3a54e6f07df87b1a.zip" -> "./.terraform/lambda-builds/6ff76a11b9e970c6c4110e68731c9332d45cd8c43c1eb159fecd2f5e17114f65.zip"
!           "timestamp" = "1691779932191584200" -> "1691801383923160000"
        }
    }

  # module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
!       id       = "5111412517708959476" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "./.terraform/lambda-builds/a74148fae6b11699785099805b107700f09ee580adc76e3b3a54e6f07df87b1a.zip" -> "./.terraform/lambda-builds/6ff76a11b9e970c6c4110e68731c9332d45cd8c43c1eb159fecd2f5e17114f65.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] must be replaced
-/+ resource "aws_lambda_layer_version" "this" {
!       arn                         = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-core-layer-s3:13" -> (known after apply)
-       compatible_architectures    = [] -> null
!       created_date                = "2023-08-11T18:53:42.491+0000" -> (known after apply)
!       id                          = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-core-layer-s3:13" -> (known after apply)
!       layer_arn                   = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-core-layer-s3" -> (known after apply)
!       s3_key                      = "builds/c5427c8de8b6e505f3d9cc7ef009d9f39400bad8cd96945674d8b72673fd1171.zip" -> "builds/e9179292624c5106538ef8c60202b25be7068060625ef1c215f49fd2811c4343.zip"
!       s3_object_version           = "9O_RhX4QTVN10QjU35xs2Dsf7afg07rv" -> (known after apply)
+       signing_job_arn             = (known after apply)
+       signing_profile_version_arn = (known after apply)
!       source_code_hash            = "cBczy27KGGBH24jP5m7BScY68KxzJ6M6ioHV8UY+gpA=" -> (known after apply)
!       source_code_size            = 24629369 -> (known after apply)
!       version                     = "13" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "5404ba23a4476bab3dc3d7fe43de3a08-5" -> (known after apply)
!       id                     = "builds/c5427c8de8b6e505f3d9cc7ef009d9f39400bad8cd96945674d8b72673fd1171.zip" -> (known after apply)
!       key                    = "builds/c5427c8de8b6e505f3d9cc7ef009d9f39400bad8cd96945674d8b72673fd1171.zip" -> "builds/e9179292624c5106538ef8c60202b25be7068060625ef1c215f49fd2811c4343.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "builds/c5427c8de8b6e505f3d9cc7ef009d9f39400bad8cd96945674d8b72673fd1171.zip" -> "builds/e9179292624c5106538ef8c60202b25be7068060625ef1c215f49fd2811c4343.zip"
-       tags                   = {} -> null
!       tags_all               = {} -> (known after apply)
!       version_id             = "9O_RhX4QTVN10QjU35xs2Dsf7afg07rv" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "zip",
+                       "./dist/function",
+                       null,
                    ],
                ]
+               filename      = "builds/e9179292624c5106538ef8c60202b25be7068060625ef1c215f49fd2811c4343.zip"
+               runtime       = "nodejs18.x"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/e9179292624c5106538ef8c60202b25be7068060625ef1c215f49fd2811c4343.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_layer_s3.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "6169990605977706423" -> (known after apply)
!       triggers = {
!           "filename"  = "builds/c5427c8de8b6e505f3d9cc7ef009d9f39400bad8cd96945674d8b72673fd1171.zip" -> "builds/e9179292624c5106538ef8c60202b25be7068060625ef1c215f49fd2811c4343.zip"
!           "timestamp" = "1691779936240638000" -> "1691801387626748000"
        }
    }

  # module.lambda_layer_s3.null_resource.sam_metadata_aws_lambda_layer_version[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_layer_version" {
!       id       = "2631800955360646629" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "builds/c5427c8de8b6e505f3d9cc7ef009d9f39400bad8cd96945674d8b72673fd1171.zip" -> "builds/e9179292624c5106538ef8c60202b25be7068060625ef1c215f49fd2811c4343.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 10 to add, 1 to change, 8 to destroy.
```
</details>